{
  "alpha_pattern": {},
  "auto_mapping": {
    "base_model_class": "PhiForCausalLM",
    "parent_library": "transformers.models.phi.modeling_phi"
  },
  "base_model_name_or_path": "microsoft/phi-1",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "hooked_emb"
  ],
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "fc2",
    "fc1",
    "v_proj",
    "q_proj",
    "k_proj",
    "dense",
    "lm_head"
  ],
  "task_type": null,
  "use_dora": false,
  "use_rslora": false
}